TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_gsc.h
/*
 * Copyright (c) 2025, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_gsc.h
 *  @brief      GSC Driver
 *  @defgroup   GSC Global SECURITY Controller (GSC)
 *
 *  @anchor ti_dl_dl_gsc_Overview
 *  # Overview
 *
 *   The GSC Library allows full configuration of the SOC Security.
 *   The GSC Module, provides standard interfaces to configure
 *      - Flash Security
 *      - SRAM Security
 *      - Peripheral Security
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup GSC
 * @{
 */
#ifndef ti_dl_dl_gsc__include
#define ti_dl_dl_gsc__include

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#define __MSPM33_HAS_GSC__

#ifdef __MSPM33_HAS_GSC__

#ifdef __cplusplus
extern "C" {
#endif

/* GSC Lock/Commit Keys */
#define DL_GSC_LOCK_KEY ((uint32_t) 0xA551U)
#define DL_GSC_COMMIT_KEY ((uint32_t) 0xA442U)

/**
 * @brief Structure representing SRAM chunks within a 16KB page
 *
 * Memory layout within each 16KB page:
 * chunk_512B_0: First 512 bytes  (offset 0x000-0x1FF)
 * chunk_512B_1: Second 512 bytes (offset 0x200-0x3FF)
 * chunk_1KB:    1KB block        (offset 0x400-0x7FF)
 * chunk_2KB:    2KB block        (offset 0x800-0xFFF)
 * chunk_4KB_0:  First 4KB block  (offset 0x1000-0x1FFF)
 * chunk_4KB_1:  Second 4KB block (offset 0x2000-0x2FFF)
 * chunk_4KB_2:  Third 4KB block  (offset 0x3000-0x3FFF)
 *
 * For each chunk:
 * - 0: Non-secure access allowed
 * - 1: Secure access only
 */
typedef struct {
    uint32_t chunk_512B_0; /*!< First 512B chunk (0x000-0x1FF) */
    uint32_t chunk_512B_1; /*!< Second 512B chunk (0x200-0x3FF) */
    uint32_t chunk_1KB;    /*!< 1KB chunk (0x400-0x7FF) */
    uint32_t chunk_2KB;    /*!< 2KB chunk (0x800-0xFFF) */
    uint32_t chunk_4KB_0;  /*!< First 4KB chunk (0x1000-0x1FFF) */
    uint32_t chunk_4KB_1;  /*!< Second 4KB chunk (0x2000-0x2FFF) */
    uint32_t chunk_4KB_2;  /*!< Third 4KB chunk (0x3000-0x3FFF) */
} DL_GSC_SRAMPageConfig;

/**
 * @brief Structure representing SRAM security configuration for all pages
 *
 * The SRAM memory map starting from base address 0x20000000 is divided into 16 pages:
 * Page 0:  0x20000000 - 0x20003FFF (16KB)
 * Page 1:  0x20004000 - 0x20007FFF (16KB)
 * Page 2:  0x20008000 - 0x2000BFFF (16KB)
 * Page 3:  0x2000C000 - 0x2000FFFF (16KB)
 * Page 4:  0x20010000 - 0x20013FFF (16KB)
 * Page 5:  0x20014000 - 0x20017FFF (16KB)
 * Page 6:  0x20018000 - 0x2001BFFF (16KB)
 * Page 7:  0x2001C000 - 0x2001FFFF (16KB)
 * Page 8:  0x20020000 - 0x20023FFF (16KB)
 * Page 9:  0x20024000 - 0x20027FFF (16KB)
 * Page 10: 0x20028000 - 0x2002BFFF (16KB)
 * Page 11: 0x2002C000 - 0x2002FFFF (16KB)
 * Page 12: 0x20030000 - 0x20033FFF (16KB)
 * Page 13: 0x20034000 - 0x20037FFF (16KB)
 * Page 14: 0x20038000 - 0x2003BFFF (16KB)
 * Page 15: 0x2003C000 - 0x2003FFFF (16KB)
 *
 * Each 16KB page is further divided into chunks that can be individually configured:
 * - Two 512B chunks  (0x000-0x1FF, 0x200-0x3FF)
 * - One 1KB chunk    (0x400-0x7FF)
 * - One 2KB chunk    (0x800-0xFFF)
 * - Three 4KB chunks (0x1000-0x1FFF, 0x2000-0x2FFF, 0x3000-0x3FFF)
 *
 * For each chunk:
 * - false: Non-secure access allowed
 * - true: Secure access only
 */
typedef struct {
    DL_GSC_SRAMPageConfig
        pages[16]; /*!< Configuration for 16 SRAM pages of 16KB each */
} DL_GSC_SRAMSecurityConfig;

/**
 * @brief Flash Bank identifiers for write protection
 */
typedef enum {
    DL_GSC_MAIN_FLASH_BANK_A = 0, /*!< Main Flash Bank A */
    DL_GSC_MAIN_FLASH_BANK_B = 1  /*!< Main Flash Bank B */
} DL_GSC_MainFlashBank;

/**
 * @brief Main Flash Sectors (2KB each)
 * Each bit represents a 2KB sector in flash memory
 */
typedef enum {
    DL_GSC_MAIN_FLASH_SECTOR_0 =
        0x00000001U, /*!< Sector 0  (0x00000000-0x000007FF) */
    DL_GSC_MAIN_FLASH_SECTOR_1 =
        0x00000002U, /*!< Sector 1  (0x00000800-0x00000FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_2 =
        0x00000004U, /*!< Sector 2  (0x00001000-0x000017FF) */
    DL_GSC_MAIN_FLASH_SECTOR_3 =
        0x00000008U, /*!< Sector 3  (0x00001800-0x00001FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_4 =
        0x00000010U, /*!< Sector 4  (0x00002000-0x000027FF) */
    DL_GSC_MAIN_FLASH_SECTOR_5 =
        0x00000020U, /*!< Sector 5  (0x00002800-0x00002FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_6 =
        0x00000040U, /*!< Sector 6  (0x00003000-0x000037FF) */
    DL_GSC_MAIN_FLASH_SECTOR_7 =
        0x00000080U, /*!< Sector 7  (0x00003800-0x00003FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_8 =
        0x00000100U, /*!< Sector 8  (0x00004000-0x000047FF) */
    DL_GSC_MAIN_FLASH_SECTOR_9 =
        0x00000200U, /*!< Sector 9  (0x00004800-0x00004FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_10 =
        0x00000400U, /*!< Sector 10 (0x00005000-0x000057FF) */
    DL_GSC_MAIN_FLASH_SECTOR_11 =
        0x00000800U, /*!< Sector 11 (0x00005800-0x00005FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_12 =
        0x00001000U, /*!< Sector 12 (0x00006000-0x000067FF) */
    DL_GSC_MAIN_FLASH_SECTOR_13 =
        0x00002000U, /*!< Sector 13 (0x00006800-0x00006FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_14 =
        0x00004000U, /*!< Sector 14 (0x00007000-0x000077FF) */
    DL_GSC_MAIN_FLASH_SECTOR_15 =
        0x00008000U, /*!< Sector 15 (0x00007800-0x00007FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_16 =
        0x00010000U, /*!< Sector 16 (0x00008000-0x000087FF) */
    DL_GSC_MAIN_FLASH_SECTOR_17 =
        0x00020000U, /*!< Sector 17 (0x00008800-0x00008FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_18 =
        0x00040000U, /*!< Sector 18 (0x00009000-0x000097FF) */
    DL_GSC_MAIN_FLASH_SECTOR_19 =
        0x00080000U, /*!< Sector 19 (0x00009800-0x00009FFF) */
    DL_GSC_MAIN_FLASH_SECTOR_20 =
        0x00100000U, /*!< Sector 20 (0x0000A000-0x0000A7FF) */
    DL_GSC_MAIN_FLASH_SECTOR_21 =
        0x00200000U, /*!< Sector 21 (0x0000A800-0x0000AFFF) */
    DL_GSC_MAIN_FLASH_SECTOR_22 =
        0x00400000U, /*!< Sector 22 (0x0000B000-0x0000B7FF) */
    DL_GSC_MAIN_FLASH_SECTOR_23 =
        0x00800000U, /*!< Sector 23 (0x0000B800-0x0000BFFF) */
    DL_GSC_MAIN_FLASH_SECTOR_24 =
        0x01000000U, /*!< Sector 24 (0x0000C000-0x0000C7FF) */
    DL_GSC_MAIN_FLASH_SECTOR_25 =
        0x02000000U, /*!< Sector 25 (0x0000C800-0x0000CFFF) */
    DL_GSC_MAIN_FLASH_SECTOR_26 =
        0x04000000U, /*!< Sector 26 (0x0000D000-0x0000D7FF) */
    DL_GSC_MAIN_FLASH_SECTOR_27 =
        0x08000000U, /*!< Sector 27 (0x0000D800-0x0000DFFF) */
    DL_GSC_MAIN_FLASH_SECTOR_28 =
        0x10000000U, /*!< Sector 28 (0x0000E000-0x0000E7FF) */
    DL_GSC_MAIN_FLASH_SECTOR_29 =
        0x20000000U, /*!< Sector 29 (0x0000E800-0x0000EFFF) */
    DL_GSC_MAIN_FLASH_SECTOR_30 =
        0x40000000U, /*!< Sector 30 (0x0000F000-0x0000F7FF) */
    DL_GSC_MAIN_FLASH_SECTOR_31 =
        0x80000000U, /*!< Sector 31 (0x0000F800-0x0000FFFF) */
    DL_GSC_MAIN_FLASH_ALL_SECTORS = 0xFFFFFFFFU /*!< All sectors */
} DL_GSC_MainFlashSector;

/**
 * @brief Helper macro to create sector ranges
 * @param start  Starting sector number (0-31)
 * @param end    Ending sector number (0-31)
 * @return Mask representing the sector range
 */
#define DL_GSC_MAIN_FLASH_SECTOR_RANGE(start, end) \
    ((DL_GSC_MAIN_FLASH_ALL_SECTORS << (start)) &  \
        (DL_GSC_MAIN_FLASH_ALL_SECTORS >> (31 - (end))))

/**
 * @brief Configure main flash write protection for specified bank
 *
 * Configures write protection for main flash memory sectors. Each sector is 2KB.
 * WEPROTA0/WEPROTB0 controls sectors 0-31
 * WEPROTA1/WEPROTB1 controls sectors 32-63
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to configure (Bank A or Bank B)
 * @param[in] sector0   Write protection mask for sectors 0-31 (WEPROTA0/WEPROTB0)
 * @param[in] sector1   Write protection mask for sectors 32-63 (WEPROTA1/WEPROTB1)
 *
 * Each bit in the sector masks corresponds to one 2KB sector:
 * - 0: Sector is not write protected
 * - 1: Sector is write protected
 *
 * @note Once a sector is write protected, it cannot be written until device reset
 *
 * Example usage:
 * @code
 * // Protect sectors 0 and 1 in lower half
 * uint32_t lower = DL_GSC_MAIN_FLASH_SECTOR_0 | DL_GSC_MAIN_FLASH_SECTOR_1;
 * // Protect sector 32 in upper half
 * uint32_t upper = DL_GSC_MAIN_FLASH_SECTOR_0; // First sector in upper half
 * DL_GSC_configureMainFlashWriteProtect(gsc, DL_GSC_MAIN_FLASH_BANK_A, lower, upper);
 * @endcode
 */
void DL_GSC_configureMainFlashWriteProtect(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t sector0, uint32_t sector1);

/**
 * @brief Get main flash write protection status for specified bank
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to check (Bank A or Bank B)
 * @param[out] sector0  Pointer to store sectors 0-31 protection status (WEPROTA0/WEPROTB0)
 * @param[out] sector1  Pointer to store sectors 32-63 protection status (WEPROTA1/WEPROTB1)
 *
 * For returned sector masks:
 * - 0: Sector is not write protected
 * - 1: Sector is write protected
 */
void DL_GSC_getMainFlashWriteProtectStatus(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t *sector0, uint32_t *sector1);

/**
 * @brief Configure write protection for NONMAIN flash region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to configure (Bank A or Bank B)
 * @param[in] sector0   Write protection mask for lower sectors (WEPROTNONMAIN0)
 * @param[in] sector1   Write protection mask for upper sectors (WEPROTNONMAIN1)
 *
 * Each bit in the sector masks corresponds to one 2KB sector:
 * - 0: Sector is not write protected
 * - 1: Sector is write protected
 *
 * @note Once a sector is write protected, it cannot be written until device reset
 *
 * Example usage:
 * @code
 * // Protect first sector in NONMAIN region of Bank A
 * DL_GSC_configureNONMAINWriteProtect(gsc, DL_GSC_MAIN_FLASH_BANK_A, 0x00000001, 0);
 * @endcode
 */
void DL_GSC_configureNONMAINWriteProtect(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t sector0, uint32_t sector1);

/**
 * @brief Get write protection status for NONMAIN flash region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to check (Bank A or Bank B)
 * @param[out] sector0  Pointer to store lower sectors protection status
 * @param[out] sector1  Pointer to store upper sectors protection status
 *
 * For returned sector masks:
 * - 0: Sector is not write protected
 * - 1: Sector is write protected
 */
void DL_GSC_getNONMAINWriteProtectStatus(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t *sector0, uint32_t *sector1);

/**
 * @brief Configure write protection for TRIM flash region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to configure (Bank A or Bank B)
 * @param[in] sector0   Write protection mask for lower sectors (WEPROTTRIM0)
 * @param[in] sector1   Write protection mask for upper sectors (WEPROTTRIM1)
 *
 * Each bit in the sector masks corresponds to one 2KB sector:
 * - 0: Sector is not write protected
 * - 1: Sector is write protected
 */
void DL_GSC_configureTRIMWriteProtect(GSC_Regs *gsc, DL_GSC_MainFlashBank bank,
    uint32_t sector0, uint32_t sector1);

/**
 * @brief Get write protection status for TRIM flash region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to check (Bank A or Bank B)
 * @param[out] sector0  Pointer to store lower sectors protection status
 * @param[out] sector1  Pointer to store upper sectors protection status
 */
void DL_GSC_getTRIMWriteProtectStatus(GSC_Regs *gsc, DL_GSC_MainFlashBank bank,
    uint32_t *sector0, uint32_t *sector1);

/**
 * @brief Configure write protection for ENGR flash region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to configure (Bank A or Bank B)
 * @param[in] sector0   Write protection mask for lower sectors (WEPROTENGR0)
 * @param[in] sector1   Write protection mask for upper sectors (WEPROTENGR1)
 */
void DL_GSC_configureENGRWriteProtect(GSC_Regs *gsc, DL_GSC_MainFlashBank bank,
    uint32_t sector0, uint32_t sector1);

/**
 * @brief Get write protection status for ENGR flash region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to check (Bank A or Bank B)
 * @param[out] sector0  Pointer to store lower sectors protection status
 * @param[out] sector1  Pointer to store upper sectors protection status
 */
void DL_GSC_getENGRWriteProtectStatus(GSC_Regs *gsc, DL_GSC_MainFlashBank bank,
    uint32_t *sector0, uint32_t *sector1);

/**
 * @brief Configure write protection for Data Flash
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] sectors   Write protection mask for data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashWriteProtect(
    GSC_Regs *gsc, uint32_t sectors)
{
    gsc->FPC_WEPROTA_DFLASH = sectors;
}

/**
 * @brief Configure security attributes for Data Flash
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] secMask   Security attributes mask for data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashSecurity(
    GSC_Regs *gsc, uint32_t secMask)
{
    gsc->FPC_SECATTRIBA_DFLASH = secMask;
}

/**
 * @brief Configure security attributes for Data Flash ENGR region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] secMask   Security attributes mask for ENGR data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashENGRSecurity(
    GSC_Regs *gsc, uint32_t secMask)
{
    gsc->FPC_ENGR_SECATTRIB_DFLASH = secMask;
}

/**
 * @brief Configure security attributes for Data Flash NONMAIN region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] secMask   Security attributes mask for NONMAIN data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashNONMAINSecurity(
    GSC_Regs *gsc, uint32_t secMask)
{
    gsc->FPC_NONMAIN_SECATTRIB_DFLASH = secMask;
}

/**
 * @brief Configure security attributes for Non-Main Flash
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] secMask   Security attributes mask for Non-Main Flash sectors (bits[3:0])
 */
__STATIC_INLINE void DL_GSC_configureNonMainFlashSecurity(
    GSC_Regs *gsc, uint32_t secMask)
{
    // Only lowest 4 bits are used since Non-Main Flash has 4 sectors
    gsc->FPC_NONMAIN_SECATTRIB0 = secMask & 0xFU;
}

/**
 * @brief Configure privilege attributes for Non-Main Flash
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] privMask  Privilege attributes mask for Non-Main Flash sectors (bits[3:0])
 */
__STATIC_INLINE void DL_GSC_configureNonMainFlashPrivilege(
    GSC_Regs *gsc, uint32_t privMask)
{
    // Only lowest 4 bits are used since Non-Main Flash has 4 sectors
    gsc->FPC_NONMAIN_PRIVATTRIB0 = privMask & 0xFU;
}

/**
 * @brief Configure privilege attributes for Data Flash
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] privMask  Privilege attributes mask for data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashPrivilege(
    GSC_Regs *gsc, uint32_t privMask)
{
    gsc->FPC_PRIVATTRIBA_DFLASH = privMask;
}

/**
 * @brief Configure privilege attributes for Data Flash NONMAIN region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] privMask  Privilege attributes mask for NONMAIN data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashNONMAINPrivilege(
    GSC_Regs *gsc, uint32_t privMask)
{
    gsc->FPC_NONMAIN_PRIVATTRIB_DFLASH = privMask;
}

/**
 * @brief Configure privilege attributes for Data Flash ENGR region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] privMask  Privilege attributes mask for ENGR data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashENGRPrivilege(
    GSC_Regs *gsc, uint32_t privMask)
{
    gsc->FPC_ENGR_PRIVATTRIB_DFLASH = privMask;
}

/**
 * @brief Configure write protection for Data Flash NONMAIN region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] sectors   Write protection mask for NONMAIN data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashNONMAINWriteProtect(
    GSC_Regs *gsc, uint32_t sectors)
{
    gsc->FPC_WEPROT_NONMAIN_DFLASH = sectors;
}

/**
 * @brief Configure write protection for Data Flash ENGR region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] sectors   Write protection mask for ENGR data flash sectors
 */
__STATIC_INLINE void DL_GSC_configureDataFlashENGRWriteProtect(
    GSC_Regs *gsc, uint32_t sectors)
{
    gsc->FPC_WEPROT_ENGR_DFLASH = sectors;
}

/**
 * @brief Get write protection status for Data Flash
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @return uint32_t     Current write protection mask for data flash sectors
 */
__STATIC_INLINE uint32_t DL_GSC_getDataFlashWriteProtectStatus(GSC_Regs *gsc)
{
    return gsc->FPC_WEPROTA_DFLASH;
}

/**
 * @brief Get write protection status for Data Flash NONMAIN region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @return uint32_t     Current write protection mask for NONMAIN region
 */
__STATIC_INLINE uint32_t DL_GSC_getDataFlashNONMAINWriteProtectStatus(
    GSC_Regs *gsc)
{
    return gsc->FPC_WEPROT_NONMAIN_DFLASH;
}

/**
 * @brief Get write protection status for Data Flash ENGR region
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @return uint32_t     Current write protection mask for ENGR region
 */
__STATIC_INLINE uint32_t DL_GSC_getDataFlashENGRWriteProtectStatus(
    GSC_Regs *gsc)
{
    return gsc->FPC_WEPROT_ENGR_DFLASH;
}

/**
 * @brief Configure security attributes for main flash regions
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to configure (Bank A or Bank B)
 * @param[in] sector0   Security mask for sectors 0-31 (SECATTRIBA0/B0)
 * @param[in] sector1   Security mask for sectors 32-63 (SECATTRIBA1/B1)
 *
 * Each bit in the sector masks corresponds to one 2KB sector:
 * - 0: Non-secure access allowed
 * - 1: Secure access only
 */
void DL_GSC_configureMainFlashSecurity(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t sector0, uint32_t sector1);

/**
 * @brief Get security attributes status for main flash regions
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to check (Bank A or Bank B)
 * @param[out] sector0  Pointer to store sectors 0-31 security status
 * @param[out] sector1  Pointer to store sectors 32-63 security status
 */
void DL_GSC_getMainFlashSecurityStatus(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t *sector0, uint32_t *sector1);

/**
 * @brief Configure privilege attributes for main flash regions
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to configure (Bank A or Bank B)
 * @param[in] sector0   Privilege mask for sectors 0-31 (PRIVATTRIBA0/B0)
 * @param[in] sector1   Privilege mask for sectors 32-63 (PRIVATTRIBA1/B1)
 *
 * Each bit in the sector masks corresponds to one 2KB sector:
 * - 0: Unprivileged access allowed
 * - 1: Privileged access only
 */
void DL_GSC_configureMainFlashPrivilege(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t sector0, uint32_t sector1);

/**
 * @brief Get privilege attributes status for main flash regions
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] bank      Main flash bank to check (Bank A or Bank B)
 * @param[out] sector0  Pointer to store sectors 0-31 privilege status
 * @param[out] sector1  Pointer to store sectors 32-63 privilege status
 */
void DL_GSC_getMainFlashPrivilegeStatus(GSC_Regs *gsc,
    DL_GSC_MainFlashBank bank, uint32_t *sector0, uint32_t *sector1);

/**
 * @brief GSC Lock/Commit Configuration Structure
 * Set field to true to lock/commit the corresponding configuration
 */
typedef struct {
    bool
        attribViolConfig; /*!< Lock/Commit attribute violation configuration */
    bool
        ppcAttrib; /*!< Lock/Commit PPC (Peripheral Protection Controller) attributes */
    bool
        spcAttrib; /*!< Lock/Commit SPC (SRAM Protection Controller) attributes */
    bool
        fppcAttrib; /*!< Lock/Commit FPPC (Flash Protection Controller) attributes */
    bool vtor; /*!< Lock/Commit Vector Table Offset Register configuration */
    bool dmaTrigSel; /*!< Lock/Commit DMA trigger selection */
    bool dtbMuxSel;  /*!< Lock/Commit DTB MUX selection */
} DL_GSC_LockConfig;

/**
 * @brief Configure hide protection region for flash
 *
 * Configures hide protection for a region of flash sectors. In single-bank mode,
 * only FPC_HDPPROT0_CONFIG is used. In dual-bank mode, both FPC_HDPPROT0_CONFIG
 * and FPC_HDPPROT1_CONFIG are available.
 *
 * Each sector is 2KB. Hide protection can be set at sector level but must be
 * managed carefully when overlapping with other protection mechanisms that
 * operate at 8KB (4-sector) page boundaries.
 *
 * @param[in] gsc       Pointer to the GSC peripheral
 * @param[in] startSec  Starting sector number (0-255) for hide protection
 * @param[in] endSec    Ending sector number (0-255) for hide protection
 * @param[in] bank      0: Configure Bank 0, 1: Configure Bank 1 (only valid in dual-bank mode)
 *
 * @note In single-bank mode, the bank parameter is ignored and FPC_HDPPROT0_CONFIG
 *       is always used.
 * @note It is the application's responsibility to ensure hide protection regions
 *       are properly aligned when overlapping with other protection mechanisms
 *       that operate at 8KB page boundaries.
 *
 * @return bool Returns true if configuration is valid, false otherwise
 */
bool DL_GSC_configureHDPRegion(
    GSC_Regs *gsc, uint8_t startSec, uint8_t endSec, uint8_t bank);

