TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_gsc.h
/**
 * @brief Enable/Disable HDP access for flash
 *
 * Controls access to hide protected regions. In single-bank mode, setting
 * access control affects both regions regardless of which control bit is used.
 *
 * @param[in] gsc     Pointer to the GSC peripheral
 * @param[in] enable  true: Enable HDP access, false: Disable HDP access
 * @param[in] bank    0: Configure Bank 0, 1: Configure Bank 1 (only valid in dual-bank mode)
 *
 * @note In single-bank mode, setting either bank's access control will affect both regions
 */
void DL_GSC_setHDPAccess(GSC_Regs *gsc, bool enable, uint8_t bank);

/**
 * @brief Enable Flash Hide Protection (HDP) mode
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableHDPMode(GSC_Regs *gsc)
{
    gsc->FPC_HDPEN_CONTROL |= GSC_FPC_HDPEN_CONTROL_HDPEN_MASK;
}

/**
 * @brief Disable Flash Hide Protection (HDP) mode
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableHDPMode(GSC_Regs *gsc)
{
    gsc->FPC_HDPEN_CONTROL &= ~GSC_FPC_HDPEN_CONTROL_HDPEN_MASK;
}

/**
 * @brief Enable HDP access to NONMAIN region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableNONMAINBank0HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_NONMAIN0_HDPPROT_CONTROL &=
        ~GSC_FPC_NONMAIN0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to NONMAIN region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableNONMAINBank0HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_NONMAIN0_HDPPROT_CONTROL |=
        GSC_FPC_NONMAIN0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to NONMAIN region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableNONMAINBank1HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_NONMAIN1_HDPPROT_CONTROL &=
        ~GSC_FPC_NONMAIN1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to NONMAIN region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableNONMAINBank1HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_NONMAIN1_HDPPROT_CONTROL |=
        GSC_FPC_NONMAIN1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to TRIM region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableTRIMBank0HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_TRIM0_HDPPROT_CONTROL &=
        ~GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to TRIM region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableTRIMBank0HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_TRIM0_HDPPROT_CONTROL |=
        GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to TRIM region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableTRIMBank1HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_TRIM1_HDPPROT_CONTROL &=
        ~GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to TRIM region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableTRIMBank1HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_TRIM1_HDPPROT_CONTROL |=
        GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to ENGR region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableENGRBank0HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_ENGR0_HDPPROT_CONTROL &=
        ~GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to ENGR region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableENGRBank0HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_ENGR0_HDPPROT_CONTROL |=
        GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to ENGR region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableENGRBank1HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_ENGR1_HDPPROT_CONTROL &=
        ~GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to ENGR region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableENGRBank1HDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_ENGR1_HDPPROT_CONTROL |=
        GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Configure hide protection region for data flash
 *
 * Configures hide protection for a region of data flash sectors.
 * Each sector is 2KB. Hide protection can be set at sector level but must be
 * managed carefully when overlapping with other protection mechanisms that
 * operate at 8KB (4-sector) page boundaries.
 *
 * @param[in] gsc       Pointer to the GSC peripheral
 * @param[in] startSec  Starting sector number for hide protection
 * @param[in] endSec    Ending sector number for hide protection
 *
 * @note It is the application's responsibility to ensure hide protection regions
 *       are properly aligned when overlapping with other protection mechanisms
 *       that operate at 8KB page boundaries.
 *
 * @return bool Returns true if configuration is valid, false otherwise
 */
bool DL_GSC_configureDataBankHDPRegion(
    GSC_Regs *gsc, uint8_t startSec, uint8_t endSec);

// Data Bank HDP Control
/**
 * @brief Enable HDP access to Data Bank region
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_HDPPROT_DBANK_CONTROL_HDPPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to Data Bank region
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_HDPPROT_DBANK_CONTROL_HDPPROTACCDIS_MASK;
}

// Data Bank HDP Enable Control
/**
 * @brief Enable HDP mode for Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankHDPMode(GSC_Regs *gsc)
{
    gsc->FPC_HDPEN_DBANK_CONTROL |= GSC_FPC_HDPEN_DBANK_CONTROL_HDPEN_MASK;
}

/**
 * @brief Disable HDP mode for Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankHDPMode(GSC_Regs *gsc)
{
    gsc->FPC_HDPEN_DBANK_CONTROL &= ~GSC_FPC_HDPEN_DBANK_CONTROL_HDPEN_MASK;
}

// Data Bank NONMAIN HDP Control
/**
 * @brief Enable HDP access to NONMAIN region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankNONMAINHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_NONMAIN_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to NONMAIN region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankNONMAINHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_NONMAIN_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

// Data Bank TRIM HDP Control
/**
 * @brief Enable HDP access to TRIM region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankTRIMHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_TRIM_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to TRIM region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankTRIMHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_TRIM_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

