TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_gsc.h
// Data Bank ENGR HDP Control
/**
 * @brief Enable HDP access to ENGR region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankENGRHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_ENGR_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to ENGR region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankENGRHDPAccess(GSC_Regs *gsc)
{
    gsc->FPC_ENGR_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 *  @brief set VTOR for NS Application Image
 *
 *
 *  @param[in] gsc      Pointer to the register overlay for the peripheral
 *  @param[in] addr_ns  NS addr where NS applications Vector Table resides
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_setVTOR_NS(GSC_Regs *gsc, uint32_t addr_ns)
{
    (gsc->VTOR_NS = addr_ns);
}

/**
 *  @brief set VTOR for S Application Image
 *
 *
 *  @param[in] gsc      Pointer to the register overlay for the peripheral
 *  @param[in] addr_s   Secure addr where S applications Vector Table resides
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_setVTOR_S(GSC_Regs *gsc, uint32_t addr_s)
{
    (gsc->VTOR_S = addr_s);
}

/**
 * @brief Allow secure access to non-secure SRAM regions
 *
 * Configures SRAM protection control to allow secure code to access
 * non-secure SRAM regions by disabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSPCSecureAccessToNSRAM(GSC_Regs *gsc)
{
    gsc->SPC_ATTRIBVIOLS_CONFIG &= ~GSC_SPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Block secure access to non-secure SRAM regions
 *
 * Configures SRAM protection control to block secure code from accessing
 * non-secure SRAM regions by enabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockSPCSecureAccessToNSRAM(GSC_Regs *gsc)
{
    gsc->SPC_ATTRIBVIOLS_CONFIG |= GSC_SPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Allow secure access to non-secure flash regions
 *
 * Configures flash protection control to allow secure code to access
 * non-secure flash regions by disabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFPCSecureAccessToNSFlash(GSC_Regs *gsc)
{
    gsc->FPC_ATTRIBVIOLS_CONFIG &= ~GSC_FPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Block secure access to non-secure flash regions
 *
 * Configures flash protection control to block secure code from accessing
 * non-secure flash regions by enabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockFPCSecureAccessToNSFlash(GSC_Regs *gsc)
{
    gsc->FPC_ATTRIBVIOLS_CONFIG |= GSC_FPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Allow secure access to non-secure peripherals
 *
 * Configures peripheral protection control to allow secure code to access
 * non-secure peripherals by disabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPPCSecureAccessToNSPeripheral(GSC_Regs *gsc)
{
    gsc->PPC_ATTRIBVIOLS_CONFIG &= ~GSC_PPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Block secure access to non-secure peripherals
 *
 * Configures peripheral protection control to block secure code from accessing
 * non-secure peripherals by enabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockPPCSecureAccessToNSPeripheral(GSC_Regs *gsc)
{
    gsc->PPC_ATTRIBVIOLS_CONFIG |= GSC_PPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Allow privileged access to non-privileged SRAM regions
 *
 * Configures SRAM protection control to allow privileged code to access
 * non-privileged SRAM regions by disabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSPCPrivilegeAccessToNPSRAM(GSC_Regs *gsc)
{
    gsc->SPC_ATTRIBVIOLP_CONFIG &= ~GSC_SPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Block privileged access to non-privileged SRAM regions
 *
 * Configures SRAM protection control to block privileged code from accessing
 * non-privileged SRAM regions by enabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockSPCPrivilegeAccessToNPSRAM(GSC_Regs *gsc)
{
    gsc->SPC_ATTRIBVIOLP_CONFIG |= GSC_SPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Allow privileged access to non-privileged flash regions
 *
 * Configures flash protection control to allow privileged code to access
 * non-privileged flash regions by disabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFPCPrivilegeAccessToNPFlash(GSC_Regs *gsc)
{
    gsc->FPC_ATTRIBVIOLP_CONFIG &= ~GSC_FPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Block privileged access to non-privileged flash regions
 *
 * Configures flash protection control to block privileged code from accessing
 * non-privileged flash regions by enabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockFPCPrivilegeAccessToNPFlash(GSC_Regs *gsc)
{
    gsc->FPC_ATTRIBVIOLP_CONFIG |= GSC_FPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Allow privileged access to non-privileged peripherals
 *
 * Configures peripheral protection control to allow privileged code to access
 * non-privileged peripherals by disabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPPCPrivilegeAccessToNPPeripheral(
    GSC_Regs *gsc)
{
    gsc->PPC_ATTRIBVIOLP_CONFIG &= ~GSC_PPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Block privileged access to non-privileged peripherals
 *
 * Configures peripheral protection control to block privileged code from accessing
 * non-privileged peripherals by enabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockPPCPrivilegeAccessToNPPeripheral(
    GSC_Regs *gsc)
{
    gsc->PPC_ATTRIBVIOLP_CONFIG |= GSC_PPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief UniComm Peripheral Secure Access Instance Selectors
 *
 * This enumeration defines the UniComm instances for configuring secure/non-secure access.
 * Each instance corresponds to a specific UniComm peripheral that can be configured
 * for secure or non-secure access.
 *
 * The values are mapped to the corresponding hardware register offsets defined in:
 * - GSC_PPC_SECATTRIB_UNICOMM register
 */
typedef enum {
    DL_GSC_SECURE_ACCESS_UNICOMM_S0U1 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U1_OFS, /*!< UniComm S0U1 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S0U2 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U2_OFS, /*!< UniComm S0U2 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S1U0 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U0_OFS, /*!< UniComm S1U0 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S1U2 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U2_OFS, /*!< UniComm S1U2 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S1U3 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U3_OFS, /*!< UniComm S1U3 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S1U4 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U4_OFS, /*!< UniComm S1U4 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S1U5 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U5_OFS, /*!< UniComm S1U5 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S2U0 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U0_OFS, /*!< UniComm S2U0 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S2U1 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U1_OFS, /*!< UniComm S2U1 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S2U2 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U2_OFS, /*!< UniComm S2U2 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_S2U3 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U3_OFS /*!< UniComm S2U3 secure access control */
} DL_GSC_SECURE_ACCESS_UNICOMM;

/**
 *  @brief Allow UniComm peripheral access from secure context only
 *
 *  This function configures the specified UniComm peripheral instance to be
 *  accessible only from M33 secure execution context.
 *
 *  @param[in] gsc       Pointer to the register overlay for the GSC peripheral
 *  @param[in] instance  UniComm instance to configure context access for
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_allowUniCommSecureAccess(
    GSC_Regs *gsc, DL_GSC_SECURE_ACCESS_UNICOMM instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_SECURE_ACCESS_UNICOMM_S0U1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S0U2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U3:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U3_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U4:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U4_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U5:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U5_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U3:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U3_MASK;
            break;
        default:
            return;  // Invalid instance
    }
    gsc->PPC_SECATTRIB_UNICOMM |= mask;
}

/**
 * @brief Allow WDT peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWDTSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_WDT |= GSC_PPC_SECATTRIB_WDT_SEC_WWDT_MASK;
}

/**
 * @brief Allow WDT peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWDTNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_WDT &= ~GSC_PPC_SECATTRIB_WDT_SEC_WWDT_MASK;
}

/**
 * @brief Check if WDT is configured for secure access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @return bool        Returns true if secure access is enabled, false for non-secure
 */
__STATIC_INLINE bool DL_GSC_isWDTSecureAccess(GSC_Regs *gsc)
{
    return (
        (gsc->PPC_SECATTRIB_WDT & GSC_PPC_SECATTRIB_WDT_SEC_WWDT_MASK) != 0);
}

/**
 *  @brief Allow UniComm peripheral access from non-secure context
 *
 *  This function configures the specified UniComm peripheral instance to be
 *  accessible from non-secure execution context.
 *
 *  @param[in] gsc       Pointer to the register overlay for the GSC peripheral
 *  @param[in] instance  UniComm instance to configure context access for
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_allowUniCommNonSecureAccess(
    GSC_Regs *gsc, DL_GSC_SECURE_ACCESS_UNICOMM instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_SECURE_ACCESS_UNICOMM_S0U1:
            mask = (GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U1_MASK);
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S0U2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U3:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U3_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U4:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U4_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S1U5:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U5_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_S2U3:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U3_MASK;
            break;
        default:
            return;  // Invalid instance
    }
    gsc->PPC_SECATTRIB_UNICOMM &= ~mask;
}

/**
 * @brief ADC Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the ADC instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific ADC peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_ADC_SECURE_ACCESS_ADC0 =
        GSC_PPC_SECATTRIB_ADC_SEC_ADC0_OFS, /*!< ADC0 M33 secure/non-secure context access control */
    DL_GSC_ADC_SECURE_ACCESS_ADC1 =
        GSC_PPC_SECATTRIB_ADC_SEC_ADC1_OFS /*!< ADC1 M33 secure/non-secure context access control */
} DL_GSC_ADC_SECURE_ACCESS;

/**
 * @brief Timer Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the Timer instances for configuring M33 secure/non-secure context access.
 * Each instance corresponds to a specific Timer peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_TIMER_SECURE_ACCESS_TIMA0_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_OFS, /*!< TIMA0_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMA0_1 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_OFS, /*!< TIMA0_1 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_OFS, /*!< TIMG4_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_1 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_OFS, /*!< TIMG4_1 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_2 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_OFS, /*!< TIMG4_2 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_3 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_OFS, /*!< TIMG4_3 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG12_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_OFS, /*!< TIMG12_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG8_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_OFS, /*!< TIMG8_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG8_1 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_OFS /*!< TIMG8_1 M33 secure/non-secure context access control */
} DL_GSC_TIMER_SECURE_ACCESS;

/**
 * @brief Allow ADC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ADC instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowADCSecureAccess(
    GSC_Regs *gsc, DL_GSC_ADC_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ADC_SECURE_ACCESS_ADC0:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC0_MASK;
            break;
        case DL_GSC_ADC_SECURE_ACCESS_ADC1:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ADC |= mask;
}

/**
 * @brief Allow ADC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ADC instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowADCNonSecureAccess(
    GSC_Regs *gsc, DL_GSC_ADC_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ADC_SECURE_ACCESS_ADC0:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC0_MASK;
            break;
        case DL_GSC_ADC_SECURE_ACCESS_ADC1:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ADC &= ~mask;
}

/**
 * @brief Allow Timer peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance Timer instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowTimerSecureAccess(
    GSC_Regs *gsc, DL_GSC_TIMER_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_2:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_3:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG12_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_TIMER |= mask;
}

/**
 * @brief Allow Timer peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance Timer instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowTimerNonSecureAccess(
    GSC_Regs *gsc, DL_GSC_TIMER_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_2:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_3:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG12_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_TIMER &= ~mask;
}

/**
 * @brief GPIO Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the GPIO instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific GPIO peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_GPIO_SECURE_ACCESS_GPIOA =
        GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_OFS, /*!< GPIOA secure/non-secure context access control */
    DL_GSC_GPIO_SECURE_ACCESS_GPIOB =
        GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_OFS, /*!< GPIOB secure/non-secure context access control */
    DL_GSC_GPIO_SECURE_ACCESS_GPIOC =
        GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_OFS /*!< GPIOC secure/non-secure context access control */
} DL_GSC_GPIO_SECURE_ACCESS;

/**
 * @brief MCAN Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the MCAN instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific MCAN peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_MCAN_SECURE_ACCESS_MCAN0 =
        GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_OFS, /*!< MCAN0 secure/non-secure context access control */
    DL_GSC_MCAN_SECURE_ACCESS_MCAN1 =
        GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_OFS /*!< MCAN1 secure/non-secure context access control */
} DL_GSC_MCAN_SECURE_ACCESS;

/**
 * @brief I2S Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the I2S instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific I2S peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_I2S_SECURE_ACCESS_I2S0 =
        GSC_PPC_SECATTRIB_I2S_SEC_I2S0_OFS, /*!< I2S0 secure/non-secure context access control */
    DL_GSC_I2S_SECURE_ACCESS_I2S1 =
        GSC_PPC_SECATTRIB_I2S_SEC_I2S1_OFS /*!< I2S1 secure/non-secure context access control */
} DL_GSC_I2S_SECURE_ACCESS;

/**
 * @brief ACOMP Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the ACOMP instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific Analog Comparator peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_ACOMP_SECURE_ACCESS_ACOMP0 =
        GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_OFS, /*!< ACOMP0 secure/non-secure context access control */
    DL_GSC_ACOMP_SECURE_ACCESS_ACOMP1 =
        GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_OFS /*!< ACOMP1 secure/non-secure context access control */
} DL_GSC_ACOMP_SECURE_ACCESS;

/**
 * @brief Allow GPIO peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance GPIO instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowGPIOSecureAccess(
    GSC_Regs *gsc, DL_GSC_GPIO_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOA:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOB:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOC:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_GPIO |= mask;
}

