TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_gsc.h
/**
 * @brief Allow GPIO peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance GPIO instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowGPIONonSecureAccess(
    GSC_Regs *gsc, DL_GSC_GPIO_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOA:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOB:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOC:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_GPIO &= ~mask;
}

/**
 * @brief Allow MCAN peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance MCAN instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowMCANSecureAccess(
    GSC_Regs *gsc, DL_GSC_MCAN_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN0:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_MASK;
            break;
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN1:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_MCAN |= mask;
}

/**
 * @brief Allow MCAN peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance MCAN instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowMCANNonSecureAccess(
    GSC_Regs *gsc, DL_GSC_MCAN_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN0:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_MASK;
            break;
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN1:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_MCAN &= ~mask;
}

/**
 * @brief Allow I2S peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance I2S instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowI2SSecureAccess(
    GSC_Regs *gsc, DL_GSC_I2S_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_I2S_SECURE_ACCESS_I2S0:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S0_MASK;
            break;
        case DL_GSC_I2S_SECURE_ACCESS_I2S1:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_I2S |= mask;
}

/**
 * @brief Allow I2S peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance I2S instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowI2SNonSecureAccess(
    GSC_Regs *gsc, DL_GSC_I2S_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_I2S_SECURE_ACCESS_I2S0:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S0_MASK;
            break;
        case DL_GSC_I2S_SECURE_ACCESS_I2S1:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_I2S &= ~mask;
}

/**
 * @brief Allow ACOMP peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ACOMP instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowACOMPSecureAccess(
    GSC_Regs *gsc, DL_GSC_ACOMP_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP0:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_MASK;
            break;
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP1:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ACOMP |= mask;
}

/**
 * @brief Allow ACOMP peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ACOMP instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowACOMPNonSecureAccess(
    GSC_Regs *gsc, DL_GSC_ACOMP_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP0:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_MASK;
            break;
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP1:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ACOMP &= ~mask;
}

/**
 * @brief Allow LFSS peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowLFSSSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_LFSS |= GSC_PPC_SECATTRIB_LFSS_SEC_LFSS_MASK;
}

/**
 * @brief Allow LFSS peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowLFSSNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_LFSS &= ~GSC_PPC_SECATTRIB_LFSS_SEC_LFSS_MASK;
}

/**
 * @brief Allow CRC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowCRCSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_CRC |= GSC_PPC_SECATTRIB_CRC_SEC_CRC_MASK;
}

/**
 * @brief Allow CRC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowCRCNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_CRC &= ~GSC_PPC_SECATTRIB_CRC_SEC_CRC_MASK;
}

/**
 * @brief Allow AES peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowAESSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_AES |= GSC_PPC_SECATTRIB_AES_SEC_AES_MASK;
}

/**
 * @brief Allow AES peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowAESNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_AES &= ~GSC_PPC_SECATTRIB_AES_SEC_AES_MASK;
}

/**
 * @brief Allow SHA peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSHASecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_SHA |= GSC_PPC_SECATTRIB_SHA_SEC_SHA_MASK;
}

/**
 * @brief Allow SHA peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSHANonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_SHA &= ~GSC_PPC_SECATTRIB_SHA_SEC_SHA_MASK;
}

/**
 * @brief Allow QSPI peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowQSPISecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_QSPI |= GSC_PPC_SECATTRIB_QSPI_SEC_QSPI_MASK;
}

/**
 * @brief Allow QSPI peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowQSPINonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_QSPI &= ~GSC_PPC_SECATTRIB_QSPI_SEC_QSPI_MASK;
}

/**
 * @brief Allow TRNG peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowTRNGSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_TRNG |= GSC_PPC_SECATTRIB_TRNG_SEC_TRNG_MASK;
}

/**
 * @brief Allow TRNG peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowTRNGNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_TRNG &= ~GSC_PPC_SECATTRIB_TRNG_SEC_TRNG_MASK;
}

/**
 * @brief Allow PKA peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPKASecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_PKA |= GSC_PPC_SECATTRIB_PKA_SEC_PKA_MASK;
}

/**
 * @brief Allow PKA peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPKANonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_PKA &= ~GSC_PPC_SECATTRIB_PKA_SEC_PKA_MASK;
}

/**
 * @brief Allow IOMUX peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowIOMUXSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_IOMUX |= GSC_PPC_SECATTRIB_IOMUX_SEC_IOMUX_MASK;
}

/**
 * @brief Allow IOMUX peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowIOMUXNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_IOMUX &= ~GSC_PPC_SECATTRIB_IOMUX_SEC_IOMUX_MASK;
}

/**
 * @brief Allow DEBUGSS peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDEBUGSSSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_DEBUGSS |= GSC_PPC_SECATTRIB_DEBUGSS_SEC_DEBUGSS_MASK;
}

/**
 * @brief Allow DEBUGSS peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDEBUGSSNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_DEBUGSS &= ~GSC_PPC_SECATTRIB_DEBUGSS_SEC_DEBUGSS_MASK;
}

/**
 * @brief Allow VREF peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowVREFSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_VREF |= GSC_PPC_SECATTRIB_VREF_SEC_VREF_MASK;
}

/**
 * @brief Allow VREF peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowVREFNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_VREF &= ~GSC_PPC_SECATTRIB_VREF_SEC_VREF_MASK;
}

/**
 * @brief Allow KEYSTORECTL peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowKEYSTORECTLSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_KEYSTORECTL |=
        GSC_PPC_SECATTRIB_KEYSTORECTL_SEC_KEYSTORECTL_MASK;
}

/**
 * @brief Allow KEYSTORECTL peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowKEYSTORECTLNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_KEYSTORECTL &=
        ~GSC_PPC_SECATTRIB_KEYSTORECTL_SEC_KEYSTORECTL_MASK;
}

/**
 * @brief Allow EAM peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowEAMSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_EAM |= GSC_PPC_SECATTRIB_EAM_SEC_EAM_MASK;
}

/**
 * @brief Allow EAM peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowEAMNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_EAM &= ~GSC_PPC_SECATTRIB_EAM_SEC_EAM_MASK;
}

/**
 * @brief Allow WUC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWUCSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_WUC |= GSC_PPC_SECATTRIB_WUC_SEC_WUC_MASK;
}

/**
 * @brief Allow WUC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWUCNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_WUC &= ~GSC_PPC_SECATTRIB_WUC_SEC_WUC_MASK;
}

/**
 * @brief Allow FRIREGS peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFRIREGSSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_FRIREGS |= GSC_PPC_SECATTRIB_FRIREGS_SEC_FRIREGS_MASK;
}

/**
 * @brief Allow FRIREGS peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFRIREGSNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_FRIREGS &= ~GSC_PPC_SECATTRIB_FRIREGS_SEC_FRIREGS_MASK;
}

/**
 * @brief Allow MEMCFG peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowMEMCFGSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_MEMCFG |= GSC_PPC_SECATTRIB_MEMCFG_SEC_MEMCFG_MASK;
}

/**
 * @brief Allow MEMCFG peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowMEMCFGNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_MEMCFG &= ~GSC_PPC_SECATTRIB_MEMCFG_SEC_MEMCFG_MASK;
}

/**
 * @brief Allow SYSCTL peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_SYSCTL |= GSC_PPC_SECATTRIB_SYSCTL_SEC_SYSCTL_MASK;
}

/**
 * @brief Allow SYSCTL peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_SYSCTL &= ~GSC_PPC_SECATTRIB_SYSCTL_SEC_SYSCTL_MASK;
}

/**
 * @brief Allow SYSCTL peripheral privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLPrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_SYSCTL |= GSC_PPC_PRIVATTRIB_SYSCTL_PRIV_SYSCTL_MASK;
}

/**
 * @brief Allow SYSCTL peripheral non-privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLNonPrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_SYSCTL &= ~GSC_PPC_PRIVATTRIB_SYSCTL_PRIV_SYSCTL_MASK;
}

/**
 * @brief Allow GSC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_GSC |= GSC_PPC_SECATTRIB_GSC_SEC_GSC_MASK;
}

/**
 * @brief Allow GSC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCNonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_GSC &= ~GSC_PPC_SECATTRIB_GSC_SEC_GSC_MASK;
}

/**
 * @brief Allow GSC peripheral privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCPrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_GSC |= GSC_PPC_PRIVATTRIB_GSC_PRIV_GSC_MASK;
}

/**
 * @brief Allow GSC peripheral non-privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCNonPrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_GSC &= ~GSC_PPC_PRIVATTRIB_GSC_PRIV_GSC_MASK;
}

__STATIC_INLINE void DL_GSC_allowDMA0PrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_DMA |= GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA0_MASK;
}

__STATIC_INLINE void DL_GSC_allowDMA0NonPrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_DMA &= ~GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA0_MASK;
}

__STATIC_INLINE void DL_GSC_allowDMA1PrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_DMA |= GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA1_MASK;
}

__STATIC_INLINE void DL_GSC_allowDMA1NonPrivilegeAccess(GSC_Regs *gsc)
{
    gsc->PPC_PRIVATTRIB_DMA &= ~GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA1_MASK;
}

/**
 * @brief Allow DMA0 peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA0SecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_DMA |= GSC_PPC_SECATTRIB_DMA_SEC_DMA0_MASK;
}

/**
 * @brief Allow DMA0 peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA0NonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_DMA &= ~GSC_PPC_SECATTRIB_DMA_SEC_DMA0_MASK;
}

/**
 * @brief Allow DMA1 peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA1SecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_DMA |= GSC_PPC_SECATTRIB_DMA_SEC_DMA1_MASK;
}

/**
 * @brief Allow DMA1 peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA1NonSecureAccess(GSC_Regs *gsc)
{
    gsc->PPC_SECATTRIB_DMA &= ~GSC_PPC_SECATTRIB_DMA_SEC_DMA1_MASK;
}

/**
 * @brief Enable PKA SRAM zeroization
 *
 * Enables zeroization functionality for PKA SRAM. When enabled,
 * the PKA SRAM content will be zeroed.
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enablePKASRAMZeroization(GSC_Regs *gsc)
{
    // Bit is active low - clearing enables zeroization
    gsc->PPC_SPARERW_GSC &= ~GSC_PPC_SPARERW_GSC_ZERO_PKASRAM_MASK;
}

/**
 * @brief Disable PKA SRAM zeroization
 *
 * Disables zeroization functionality for PKA SRAM. When disabled,
 * the PKA SRAM content will be preserved.
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disablePKASRAMZeroization(GSC_Regs *gsc)
{
    // Bit is active low - setting disables zeroization
    gsc->PPC_SPARERW_GSC |= GSC_PPC_SPARERW_GSC_ZERO_PKASRAM_MASK;
}

/** @brief DMA Fixed Trigger Sources */
typedef enum {
    DL_GSC_DMA_FIXED_TRIG_AES_PUB1   = 0,  /*!< AESADV.PUBLISHER_1 */
    DL_GSC_DMA_FIXED_TRIG_AES_PUB2   = 1,  /*!< AESADV.PUBLISHER_2 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG1 = 2,  /*!< ADC0_DMA_TRIG1 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG2 = 3,  /*!< ADC0_DMA_TRIG2 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG3 = 4,  /*!< ADC0_DMA_TRIG3 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG4 = 5,  /*!< ADC0_DMA_TRIG4 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG1 = 6,  /*!< ADC1_DMA_TRIG1 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG2 = 7,  /*!< ADC1_DMA_TRIG2 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG3 = 8,  /*!< ADC1_DMA_TRIG3 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG4 = 9,  /*!< ADC1_DMA_TRIG4 */
    DL_GSC_DMA_FIXED_TRIG_SHA_PUB1   = 10, /*!< SHA.PUBLISHER_1 */
} DL_GSC_DMA_FixedTrigger;

/** @brief DMA Regular Trigger Sources */
typedef enum {
    DL_GSC_DMA_TRIG_I2S0_PUB1 = 0,  /*!< I2S0.PUBLISHER_1 */
    DL_GSC_DMA_TRIG_I2S0_PUB2 = 1,  /*!< I2S0.PUBLISHER_2 */
    DL_GSC_DMA_TRIG_I2S1_PUB1 = 2,  /*!< I2S1.PUBLISHER_1 */
    DL_GSC_DMA_TRIG_I2S1_PUB2 = 3,  /*!< I2S1.PUBLISHER_2 */
    DL_GSC_DMA_TRIG_QSPI_PUB1 = 4,  /*!< QSPI.PUBLISHER_1 */
    DL_GSC_DMA_TRIG_QSPI_PUB2 = 5,  /*!< QSPI.PUBLISHER_2 */
    DL_GSC_DMA_TRIG_S0U1_TX   = 6,  /*!< S0U1_TX (DMA0 only) */
    DL_GSC_DMA_TRIG_S0U1_RX   = 7,  /*!< S0U1_RX (DMA0 only) */
    DL_GSC_DMA_TRIG_S0U2_TX   = 8,  /*!< S0U2_TX (DMA0 only) */
    DL_GSC_DMA_TRIG_S0U2_RX   = 9,  /*!< S0U2_RX (DMA0 only) */
    DL_GSC_DMA_TRIG_S1U0_TX   = 10, /*!< S1U0_TX */
    DL_GSC_DMA_TRIG_S1U0_RX   = 11, /*!< S1U0_RX */
    DL_GSC_DMA_TRIG_S1U2_TX   = 12, /*!< S1U2_TX */
    DL_GSC_DMA_TRIG_S1U2_RX   = 13, /*!< S1U2_RX */
    DL_GSC_DMA_TRIG_S1U3_TX   = 14, /*!< S1U3_TX */
    DL_GSC_DMA_TRIG_S1U3_RX   = 15, /*!< S1U3_RX */
    DL_GSC_DMA_TRIG_S1U4_TX   = 16, /*!< S1U4_TX */
    DL_GSC_DMA_TRIG_S1U4_RX   = 17, /*!< S1U4_RX */
    DL_GSC_DMA_TRIG_S1U5_TX   = 18, /*!< S1U5_TX */
    DL_GSC_DMA_TRIG_S1U5_RX   = 19, /*!< S1U5_RX */
    DL_GSC_DMA_TRIG_S2U0_TX   = 20, /*!< S2U0_TX */
    DL_GSC_DMA_TRIG_S2U0_RX   = 21, /*!< S2U0_RX */
    DL_GSC_DMA_TRIG_S2U1_TX   = 22, /*!< S2U1_TX */
    DL_GSC_DMA_TRIG_S2U1_RX   = 23, /*!< S2U1_RX */
    DL_GSC_DMA_TRIG_S2U2_TX   = 24, /*!< S2U2_TX */
    DL_GSC_DMA_TRIG_S2U2_RX   = 25, /*!< S2U2_RX */
    DL_GSC_DMA_TRIG_S2U3_TX   = 26, /*!< S2U3_TX */
    DL_GSC_DMA_TRIG_S2U3_RX   = 27, /*!< S2U3_RX */
} DL_GSC_DMA_RegularTrigger;

/** @brief DMA Instance selection */
typedef enum {
    DL_GSC_DMA_INSTANCE_0 = 0, /*!< Route trigger to DMA0 */
    DL_GSC_DMA_INSTANCE_1 = 1  /*!< Route trigger to DMA1 */
} DL_GSC_DMA_Instance;

/* Function prototypes */
void DL_GSC_setFixedTriggerDMAInstance(GSC_Regs *gsc,
    DL_GSC_DMA_FixedTrigger trigger, DL_GSC_DMA_Instance instance);
void DL_GSC_setRegularTriggerDMAInstance(GSC_Regs *gsc,
    DL_GSC_DMA_RegularTrigger trigger, DL_GSC_DMA_Instance instance);
DL_GSC_DMA_Instance DL_GSC_getFixedTriggerDMAInstance(
    GSC_Regs *gsc, DL_GSC_DMA_FixedTrigger trigger);
DL_GSC_DMA_Instance DL_GSC_getRegularTriggerDMAInstance(
    GSC_Regs *gsc, DL_GSC_DMA_RegularTrigger trigger);

