TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_gsc.h
typedef enum {
    DL_GSC_SPC_BLOCK_C0B0_512B = GSC_SPC_SECATTRIB0_C0B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C0B1_512B = GSC_SPC_SECATTRIB0_C0B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C0B0_1KB  = GSC_SPC_SECATTRIB0_C0B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C0B0_2KB  = GSC_SPC_SECATTRIB0_C0B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C0B0_4KB  = GSC_SPC_SECATTRIB0_C0B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C0B1_4KB  = GSC_SPC_SECATTRIB0_C0B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C0B2_4KB  = GSC_SPC_SECATTRIB0_C0B2_4KB_MASK,
    DL_GSC_SPC_BLOCK_C1B0_512B = GSC_SPC_SECATTRIB0_C1B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C1B1_512B = GSC_SPC_SECATTRIB0_C1B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C1B0_1KB  = GSC_SPC_SECATTRIB0_C1B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C1B0_2KB  = GSC_SPC_SECATTRIB0_C1B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C1B0_4KB  = GSC_SPC_SECATTRIB0_C1B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C1B1_4KB  = GSC_SPC_SECATTRIB0_C1B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C1B2_4KB  = GSC_SPC_SECATTRIB0_C1B2_4KB_MASK,
    DL_GSC_SPC_BLOCK_C2B0_512B = GSC_SPC_SECATTRIB0_C2B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C2B1_512B = GSC_SPC_SECATTRIB0_C2B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C2B0_1KB  = GSC_SPC_SECATTRIB0_C2B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C2B0_2KB  = GSC_SPC_SECATTRIB0_C2B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C2B0_4KB  = GSC_SPC_SECATTRIB0_C2B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C2B1_4KB  = GSC_SPC_SECATTRIB0_C2B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C2B2_4KB  = GSC_SPC_SECATTRIB0_C2B2_4KB_MASK,
    DL_GSC_SPC_BLOCK_C3B0_512B = GSC_SPC_SECATTRIB0_C3B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C3B1_512B = GSC_SPC_SECATTRIB0_C3B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C3B0_1KB  = GSC_SPC_SECATTRIB0_C3B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C3B0_2KB  = GSC_SPC_SECATTRIB0_C3B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C3B0_4KB  = GSC_SPC_SECATTRIB0_C3B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C3B1_4KB  = GSC_SPC_SECATTRIB0_C3B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C3B2_4KB  = GSC_SPC_SECATTRIB0_C3B2_4KB_MASK,
} DL_GSC_SPC_BLOCK;

/**
 *  @brief Set DICE Check SUM
 *
 *
 *  @param[in] gsc          Pointer to the register overlay for the peripheral
 *  @param[in] dice         DICE array of 8 32-bit integers
 *  @return    void
 */
__STATIC_INLINE
void DL_GSC_setDICECheckSum(GSC_Regs *gsc, const uint32_t *dice)
{
    uint32_t volatile *diceBaseAddr = (&(gsc->DICE_CHECKSUM0));
    const uint8_t diceLength        = 8U;
    for (uint8_t i = 0; i < diceLength; i++) {
        diceBaseAddr[i] = dice[i];
    }
}

/**
 * @brief Get the major revision number of GSC module
 *
 * @param gsc Pointer to GSC registers
 * @return uint8_t Major revision number
 */
static inline uint8_t DL_GSC_getMajorRevision(GSC_Regs *gsc)
{
    return ((gsc->GSC_REVISION & GSC_GSC_REVISION_MAJREV_MASK) >>
            GSC_GSC_REVISION_MAJREV_OFS);
}

/**
 * @brief Get the minor revision number of GSC module
 *
 * @param gsc Pointer to GSC registers
 * @return uint8_t Minor revision number
 */
static inline uint8_t DL_GSC_getMinorRevision(GSC_Regs *gsc)
{
    return ((gsc->GSC_REVISION & GSC_GSC_REVISION_MINREV_MASK) >>
            GSC_GSC_REVISION_MINREV_OFS);
}

/**
 * @brief Acquires flash semaphore and returns
 * @note  If the following conditions are met, a write of '1' to this bit causes the FLSEMSTAT register to its reset state: <br/>
 * @note  1) The FLSEMSTAT.SEC of the code performing the write is 0x1 and FLSEMSTAT.PRIV of the code performing the write is 0x1 (i.e. secure privilage code can force relinquishing of the semaphore) or
 * @note  2) FLSEMSTAT.ASSIGNED bit is set, and
 * @note      a) FLSEMSTAT.SEC matches security attribute of the code performing the write, and
 * @note      b) FLSEMSTAT.PRIV matches privilege attribute code performing the write.
 *
 *   If the above conditions are not met during the write, the write will be ignored with no error indicated. It is advised that the writing code perform a read of the FLSEMSTAT register to ensure it was cleared after writing to this bit.
 *
 * @note
 * @param  *gsc: GSC_Regs
 * @retval None
 */
__STATIC_INLINE void DL_GSC_acquireFlashSemaphore(GSC_Regs *gsc)
{
    while (!(((gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_ASSIGNED_MASK) ==
                 GSC_FPC_FLSEMSTAT_ASSIGNED_MASK) &&
             ((gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_MATCH_MASK) ==
                 GSC_FPC_FLSEMSTAT_MATCH_MASK))) {
        gsc->FPC_FLSEMREQ = GSC_FPC_FLSEMREQ_REQ_MASK;
    }
}

/**
 * @brief  Returns current Flash Semaphore Status

 * @note Bits	Field Name	Description
 * @note
 * @note   31:31	ASSIGNED	SEC and PRIV fields are valid when this bit is set.
 * @note        0 : SEC and PRIV are unassigned and flash controller is not accessible
 * @note        1 : SEC and PRIV values are valid and the flash controller is currently assigned to them
 * @note
 * @note   30:30	MATCH	On a read, this bit will reflect whether the reader's SEC and PRIV matches the ownership of the flash controller.
 * @note        0 : Code performing read does not own the flash controller semaphore
 * @note        1 : Code performing read owns the flash controller semphore.
 * @note This avoids code from being required to know whether the current code segment owns the flash controller configuration.
 * @note
 * @note   29:17	Reserved_3	Reserved
 * @note
 * @note   16:16	DBGACC	Defines the flash controller semaphore owners debug access indication
 * @note        0x0 : functional access
 * @note        0x1 : Debug access
 * @note
 * @note   15:9	Reserved_2	Reserved
 * @note
 * @note   8:8	PRIV	Defines the flash controller semaphore owners privilage attribute
 * @note        0x0 : non-privilage
 * @note        0x1 :prvilage
 * @note
 * @note   7:1	Reserved_1	Reserved
 * @note
 * @note   0:0	SEC	Defines the flash controller semaphore owners security attribute
 * @note        0x0 : non-secure
 * @note        0x1 :secure
 * @param  *gsc: GSC_Regs
 * @retval
 */
__STATIC_INLINE uint32_t DL_GSC_getFlashSemaphoreStatus(GSC_Regs *gsc)
{
    return gsc->FPC_FLSEMSTAT;
}

/**
 * @brief Request flash semaphore
 *
 * @param gsc         Pointer to the GSC register structure
 */
__STATIC_INLINE void DL_GSC_requestFlashSemaphore(GSC_Regs *gsc)
{
    gsc->FPC_FLSEMREQ = GSC_FPC_FLSEMREQ_REQ_MASK;
}

/**
 * @brief Clear/release flash semaphore
 *
 * @param gsc         Pointer to the GSC register structure
 */
__STATIC_INLINE void DL_GSC_clearFlashSemaphore(GSC_Regs *gsc)
{
    gsc->FPC_FLSEMCLR = GSC_FPC_FLSEMCLR_CLR_MASK;
}

/**
 * @brief Check if current requester owns the flash semaphore
 *
 * @param gsc         Pointer to the GSC register structure
 * @return true       Current requester owns the semaphore
 * @return false      Current requester does not own the semaphore
 *
 * @note The MATCH bit indicates whether the code reading the register owns
 *       the flash semaphore based on matching SEC and PRIV attributes
 */
__STATIC_INLINE bool DL_GSC_hasFlashSemaphoreMatch(GSC_Regs *gsc)
{
    return ((gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_MATCH_MASK) != 0U);
}

/**
 * @brief Check if flash semaphore is assigned
 *
 * @param gsc         Pointer to the GSC register structure
 * @return bool       True if semaphore is assigned, false otherwise
 */
__STATIC_INLINE bool DL_GSC_isFlashSemaphoreAssigned(GSC_Regs *gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_ASSIGNED_MASK);
}

/**
 * @brief Check if flash semaphore is in secure state
 *
 * @param gsc         Pointer to the GSC register structure
 * @return bool       True if in secure state, false otherwise
 */
__STATIC_INLINE bool DL_GSC_isFlashSemaphoreSecure(GSC_Regs *gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_SEC_MASK);
}

/**
 * @brief Check if flash semaphore is in privileged state
 *
 * @param gsc         Pointer to the GSC register structure
 * @return bool       True if in privileged state, false otherwise
 */
__STATIC_INLINE bool DL_GSC_isFlashSemaphorePrivileged(GSC_Regs *gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_PRIV_MASK);
}

/**
 * @brief Debug Access bit functionality in FPC_FLSEMSTAT
 *
 * FPC_FLSEMSTAT Register:
 * - DBGACC (Debug Access):
 *   1 = Semaphore held by debugger
 *   0 = Normal code execution access
 */

__STATIC_INLINE bool DL_GSC_isFlashSemaphoreDebugAccess(GSC_Regs *gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_DBGACC_MASK);
}

/**
 * @brief Set lock configuration using configuration structure
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] config    Pointer to lock configuration structure
 *
 * @note Once locked, configurations cannot be modified unless uncommitted
 * @note Writing lock requires valid key (0xA551)
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig lockCfg = {0};  // Initialize all to false
 * lockCfg.vtor = true;              // Lock VTOR configuration
 * lockCfg.dmaTrigSel = true;        // Lock DMA trigger selection
 * DL_GSC_setLockConfiguration(gsc, &lockCfg);
 * @endcode
 */
void DL_GSC_setLockConfiguration(
    GSC_Regs *gsc, const DL_GSC_LockConfig *config);

/**
 * @brief Get current lock configuration
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[out] config   Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig currentCfg;
 * DL_GSC_getLockConfiguration(gsc, &currentCfg);
 * if(currentCfg.vtor) {
 *     // VTOR configuration is locked
 * }
 * @endcode
 */
void DL_GSC_getLockConfiguration(GSC_Regs *gsc, DL_GSC_LockConfig *config);

/**
 * @brief Set commit configuration using configuration structure
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] config    Pointer to commit configuration structure
 *
 * @note Once committed, configurations cannot be modified until reset
 * @note Writing commit requires valid key (0xA442)
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig commitCfg = {0};  // Initialize all to false
 * commitCfg.vtor = true;              // Commit VTOR configuration
 * commitCfg.dmaTrigSel = true;        // Commit DMA trigger selection
 * DL_GSC_setCommitConfiguration(gsc, &commitCfg);
 * @endcode
 */
void DL_GSC_setCommitConfiguration(
    GSC_Regs *gsc, const DL_GSC_LockConfig *config);

/**
 * @brief Get current commit configuration
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[out] config   Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig currentCommitCfg;
 * DL_GSC_getCommitConfiguration(gsc, &currentCommitCfg);
 * if(currentCommitCfg.vtor) {
 *     // VTOR configuration is committed
 * }
 * @endcode
 */
void DL_GSC_getCommitConfiguration(GSC_Regs *gsc, DL_GSC_LockConfig *config);

/**
 * @brief Configure SRAM security attributes for all memory regions
 *
 * Configures security access permissions for SRAM memory blocks. The memory is divided into
 * 16 pages of 16KB each, with each page further subdivided into configurable chunks.
 * Setting a chunk to secure (true) restricts access to secure execution context only.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[in] config  Pointer to SRAM security configuration structure
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config = {0}; // Initialize all access as non-secure
 * config.pages[0].chunk_512B_0 = true;    // Set first 512B chunk as secure
 * config.pages[0].chunk_4KB_0 = true;     // Set first 4KB chunk as secure
 * DL_GSC_configureSRAMSecurity(gsc, &config);
 * @endcode
 */
void DL_GSC_configureSRAMSecurity(
    GSC_Regs *gsc, const DL_GSC_SRAMSecurityConfig *config);

/**
 * @brief Configure SRAM privilege attributes for all memory regions
 *
 * Configures privilege access permissions for SRAM memory blocks. The memory is divided into
 * 16 pages of 16KB each, with each page further subdivided into configurable chunks.
 * Setting a chunk to privileged (true) restricts access to privileged execution only.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[in] config  Pointer to SRAM security configuration structure
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config = {0}; // Initialize all access as non-privileged
 * config.pages[0].chunk_512B_0 = true;    // Set first 512B chunk as privileged
 * config.pages[0].chunk_4KB_0 = true;     // Set first 4KB chunk as privileged
 * DL_GSC_configureSRAMPrivilege(gsc, &config);
 * @endcode
 */
void DL_GSC_configureSRAMPrivilege(
    GSC_Regs *gsc, const DL_GSC_SRAMSecurityConfig *config);

/**
 * @brief Get current SRAM privilege configuration
 *
 * Reads current privilege access permissions for all SRAM memory blocks.
 * For each chunk in the configuration, returns true if access is restricted
 * to privileged execution context only.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[out] config Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config;
 * DL_GSC_getSRAMPrivilegeConfig(gsc, &config);
 * if(config.pages[0].chunk_512B_0) {
 *     // First 512B chunk is privileged access only
 * }
 * @endcode
 */
void DL_GSC_getSRAMPrivilegeConfig(
    GSC_Regs *gsc, DL_GSC_SRAMSecurityConfig *config);

/**
 * @brief Get current SRAM security configuration
 *
 * Reads current security access permissions for all SRAM memory blocks.
 * For each chunk in the configuration, returns true if access is restricted
 * to secure execution context only.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[out] config Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config;
 * DL_GSC_getSRAMSecurityConfig(gsc, &config);
 * if(config.pages[0].chunk_512B_0) {
 *     // First 512B chunk is secure access only
 * }
 * @endcode
 */
void DL_GSC_getSRAMSecurityConfig(
    GSC_Regs *gsc, DL_GSC_SRAMSecurityConfig *config);

#ifdef __cplusplus
}
#endif

#endif /* __MSPM33_HAS_GSC__ */

#endif  // ti_dl_dl_gsc__include
